10/data/attachments/ecd64f7e5e4e222e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fbe1899d-da72-471c-9ef4-4418cf35f086</nif:username>
            <nif:friendToBeAdded>Cheryl_store_Friend_77830_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>